app/views/traceroutes/index.html.erb

SELECT "servers".* FROM "servers"
---

    <%=select("Server", "1", @servers.collect {|s| [s.ip, s.id]}, {:include_blank => '--Select a server--'}) %>