app/controllers/servers_controller.rb

SELECT "servers".* FROM "servers"
---
  def index
    @servers = Server.all

SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @server = Server.find(params[:id])

SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @server = Server.find(params[:id])

INSERT INTO "servers" ("city", "country", "created_at", "ip", "latitude", "longitude", "name", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @server = Server.new(:hostname => params[:server][:hostname], :ip => params[:server][:ip])

    updateCategories

    respond_to do |format|
      if @server.save

SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "servers" SET "country" = 'US', "state" = 'CA', "city" = 'Berkeley', "zip" = 94704, "latitude" = 100.0, "longitude" = 100.0, "updated_at" = '2012-10-22 06:01:01.692823' WHERE "servers"."id" = 1
---
  def update
    @server = Server.find(params[:id])

    updateCategories

    respond_to do |format|
      if @server.update_attributes(:hostname => params[:server][:hostname], :ip => params[:server][:ip])

SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "servers" WHERE "servers"."id" = ?  [["id", 2]]
---
  def destroy
    @server = Server.find(params[:id])
    @server.destroy