app/controllers/traceroutes_controller.rb

SELECT "servers".* FROM "servers"
---
  def index
    @servers = Server.all

SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def render_map
    @s1 = Server.find(params[:server1])